app/views/articles/show.html.erb

<hr>
<h4>Комментарии(<%= @article.comments.size %>)</h4>

<% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 8]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 8]]