app/controllers/articles_controller.rb

  def index
    @articles = Article.all.order(created_at: :desc)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC

  def create
    @article = Article.new(article_params)
    if @article.save
      @article.author = current_user.username
      @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["text", "test"], ["created_at", "2021-10-17 10:08:38.830239"], ["updated_at", "2021-10-17 10:08:38.830239"]]
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test2"], ["text", "test2"], ["created_at", "2021-10-17 10:15:08.850805"], ["updated_at", "2021-10-17 10:15:08.850805"]]

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "test22"], ["updated_at", "2021-10-17 10:16:03.894356"], ["id", 33]]