app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)
    if @contact.valid?
      @contact.save
---
INSERT INTO "contacts" ("email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "dfs"], ["message", "hjk"], ["created_at", "2021-09-26 16:21:00.758986"], ["updated_at", "2021-09-26 16:21:00.758986"]]